def kiril_to_lotin(text):
    d = {
        'a': 'а', 'A': 'А',
        'b': 'б', 'B': 'Б',
        'd': 'д', 'D': 'Д',
        'ye': 'е', 'Ye': 'Е',
        'f': 'ф', 'F': 'Ф',
        'g': 'г', 'G': 'Г',
        'h': 'ҳ', 'H': 'Ҳ',
        'i': 'и', 'I': 'И',
        'j': 'ж', 'J': 'Ж',
        'k': 'к', 'K': 'К',
        'l': 'л', 'L': 'Л',
        'm': 'м', 'M': 'М',
        'n': 'н', 'N': 'Н',
        'o': 'о', 'O': 'О',
        'p': 'п', 'P': 'П',
        'q': 'қ', 'Q': 'Қ',
        'r': 'р', 'R': 'Р',
        's': 'с', 'S': 'С',
        't': 'т', 'T': 'Т',
        'u': 'у', 'U': 'У',
        'v': 'в', 'V': 'В',
        'x': 'ҳ', 'X': 'Ҳ',
        'y': 'й', 'Y': 'Й',
        'z': 'з', 'Z': 'З',
        'ʼ': 'ъ',
        "O'": 'Ў', "o'": 'ў',
        'Sh': 'Ш', 'sh': 'ш',
        'Ch': 'Ч', 'ch': 'ч',
        'Yu': 'Ю', 'yu': 'ю',
        'Ya': 'Я', 'ya': 'я',
        "G'": 'Ғ', "g'": 'ғ',
        'Yo': 'Ё', 'yo': 'ё',
        'E':'Э', 'e': 'э',
        ' ': ' '
    }

    s = ''
    l = ''
    for i in text:
        if i.isalpha():
            if i == 'c':
                l = i
                continue
            if d.get(l+i):
                s = s[:-1] + d[l+i]
                pass
            else:
                s += d[i]
            l = i
        else:
            s += i
    return s
print(kiril_to_lotin('#raxmat'))
